export function createNickName (){

    const 관형사 = [
        "분노하는", "귀여운", "배고픈", "사랑스러운", "똑똑한", "피곤한", "활발한", "차분한", "건강한", "고마운",
        "짜증나는", "재미있는", "우아한", "거대한", "작은", "창의적인", "성실한", "충실한", "날카로운", "머리가 좋은",
        "행복한", "솔직한", "최고의", "끈질긴", "엉뚱한", "섹시한", "용감한", "소심한", "부끄러운", "창의적인",
        "화난", "멋진", "지적인", "냉정한", "명랑한", "자신감 있는", "우아한", "친절한", "독립적인", "무서운",
        "재치있는", "애교 있는", "흥분한", "우울한", "친절한", "근엄한", "창조적인", "훌륭한", "자신감 있는", "놀라운",
        "지루한", "훈련받은", "어린", "느린", "순진한", "최고의", "나쁜", "낮은", "빠른", "슬픈",
        "위대한", "이상한", "부정적인", "긍정적인", "바쁜", "집요한", "부드러운", "강력한", "의존적인", "완벽한",
        "강렬한", "침착한", "예민한", "지능적인", "우수한", "쾌활한", "공격적인", "유머러스한", "좋은", "상냥한",
        "유연한", "날카로운", "풍부한", "신뢰할 수 있는", "재빠른", "무례한", "낡은", "도전적인", "자유로운", "위험한",
        "착한", "적극적인", "정직한", "모험적인", "아름다운", "새로운", "충실한", "대담한", "근엄한", "바보같은",
        "훌륭한", "역겨운", "기뻐하는", "확신 있는", "매혹적인", "달콤한", "인기 있는", "고상한", "어려운", "낭만적인"
      ];

    const 동물 = [
        "사자", "호랑이", "곰", "원숭이", "코끼리", "기린", "하마", "악어", "얼룩말", "판다",
        "고릴라", "침팬지", "코알라", "카멜레온", "사슴", "순록", "사막여우", "백호", "수달", "비버",
        "다람쥐", "토끼", "고양이", "개", "오리", "거북이", "펭귄", "돌고래", "상어", "고래",
        "문어", "낙타", "늑대", "뱀", "앵무새", "참새", "타조", "카멜", "악어", "오소리", "물범",
        "쿼카", "바다거북", "가재", "코뿔소", "앵무새", "햄스터", "토끼", "햄스터", "돼지", "송아지",
        "벌", "나비", "강아지", "고양이", "말", "소", "돼지", "양", "치타", "표범", "수달",
        "바다거북", "타조", "오리", "백조", "앵무새", "거위", "홍학", "매미", "날치기", "참새",
        "토끼", "코끼리", "코알라", "하이에나", "기린", "하마", "늑대", "여우", "너구리", "두더지",
        "토끼", "판다", "백호", "사자", "호랑이", "기린", "코끼리", "원숭이", "악어", "판다",
        "사슴", "순록", "곰", "사막여우", "사자"
    ];

    const newName = 관형사[Math.floor(Math.random()*관형사.length)]+" "+동물[Math.floor(Math.random()*동물.length)];
    return newName;
}